chat_system_152622787_actor_description=Lina, Ice Spirit.
chat_system_152622787_snap_mechgard_question=^?^Wait! Wow, the indicator of my Satellite's energy-catcher is off the scale! Look, young man, a strong source of energy seems to be coming from the south. My devices need this energy very badly - my batteries are almost completely spent.<br>If you help me to recharge, you'll get the help of the best mercenary of Litan!
chat_system_152622787_snap_mechgard_answer_0=^?^Where did you say that source was?
chat_system_152622787_snap_23_question=^?^Directly to the south. Gallop further along the path and turn right. I'll tell you when we are nearing the place.
chat_system_152622787_snap_23_answer_0=^?^Ok.
chat_system_152622787_snap_okolo_question=^?^My devices even start to sparkle. There's a generator very close. Aha, here it is - on the ground behind the bridge.
chat_system_152622787_snap_okolo_answer_0=^?^Let's get closer. But first I'm going to need to kill the monsters.
chat_system_152622787_switch_0_header_2=^?^So what are we waiting for? My devices will soon turn into a heap of useless trash, and my end will draw near. I need that Energy!
chat_system_152622787_switch_0_header_3=^?^What do you want from your mercenary, [player]? I am ready to bring all the power of my magic and battle devices down on your enemy.
chat_system_152622787_snap_22_question=^?^Hey you, close the artifact, we're discussing what we should do now that our prison has a new owner. Eavesdropping is bad manners.
chat_system_152622787_snap_22_answer_0=^?^I'm sorry... (Close the Chest...)
chat_system_152622787_snap_11_question=^?^Finally somebody to talk with. It's so boring in that damned Chest.
chat_system_152622787_snap_11_answer_0=^?^What about the other Spirits that are in the Chest with you?
chat_system_152622787_snap_12_question=^?^For a thousand years I've been bored out of my mind with them. They're no company. The stony one is hopelessly stupid; the swamp prince is always sleeping. But at least he can entertain me with a good conversation; you can see at once that he's got some culture. Talking with the Guard makes me sick. Try it and you'll see what I'm talking about.
chat_system_152622787_snap_12_answer_0=^?^Yeah, you probably are pretty bored.
chat_system_152622787_snap_13_question=^?^That's not even the word for it! Over the centuries I've memorized all the records in my visio-crystals, reassembled all my devices three times, and optimized all my spells. Well, if I had only done this a couple of thousand years ago, I'd be sitting in my castle in Litan right now, not locked away in this damned Chest. And I'd be in my own body, not trapped in a matrix projection...
chat_system_152622787_snap_13_answer_0=^?^What? I have no idea what you're talking about.
chat_system_152622787_snap_14_question=^?^Oh, yeah, I forgot who I'm talking to. A shining representative of the standard Middle Ages. <br>Great company you are! Have you even invented gun-powder yet? Or the "Teleport" spell?<br>Anyway, I've seen you have cannons that can fire cannonballs. Or do they also work by magic?
chat_system_152622787_snap_14_answer_0=^?^That's a dwarven invention. You just heat the plate that has the sun symbol on it, and thunder-powder shoots the ball out of the barrel. And you'd better stand aside and cover your ears!
chat_system_152622787_snap_14_header_0=^?^Hmm.... It's even worse than I supposed. Though I guess it could be worse still. Judging by your psychophysical characteristics, your race was simply created by someone not long ago. I think you just haven't had enough time to evolve - or perhaps your evolution has been artificially restrained.<br><br>So, what did you want from me?
chat_system_152622787_snap_0_question=^?^Oh, finally you're paying attention to me again. Shall we chat? I'm so tired of doing nothing that I'm even ready to answer a couple of your questions, which I am sure will be very silly.
chat_system_152622787_snap_0_answer_0=^?^Where can I get this energy for you?
chat_system_152622787_snap_0_answer_1=^?^So who are you, sorceress?
chat_system_152622787_snap_0_answer_2=^?^What do I need to do to get myself a famous combat sorceress?
chat_system_152622787_snap_0_answer_3=^?^If you're a mercenary, then maybe I can hire you?
chat_system_152622787_snap_0_answer_4=^?^Do you know anything about this Chest?
chat_system_152622787_snap_0_header_4=^?^I'm sorry but I can't really help you. I tried to examine it with my devices, but except for the fact that a very powerful but unknown magic is enclosed in it, I can't tell you anything.<br>Though there's one thing I can tell you. To control the Chest you don't need the kind of Mana which is used for casting spells in your world. Instead you need Rage. By this I mean the world's psycho-emotional background energy. Strong emotions - like pain, anger, spite, rage... They feed the Chest.
chat_system_152622787_snap_0_answer_5=^?^How did you get into the Chest?
chat_system_152622787_snap_0_header_5=^?^Ever since the day I lost my body, I dedicated all my efforts to searching for some way to create a new spirit receptacle. I was sure that one of the worlds must have what I was looking for.<br>In my search I wandered to the world of Demonis. It's a strange one, very poor from a magic point of view, but with very intense psycho-background - which immediately had all my devices going haywire. There the Chest's owner came across me. I tried to stand up to him, but while all my devices were going mad, my magic was barely enough to hold myself together. It's not easy to maintain your life being outside of your body - your chances are close to zero, you know. So I was captured.
chat_system_152622787_snap_0_answer_6=^?^Tell me about your world.
chat_system_152622787_snap_0_header_6=^?^You'd like to know about Litan? Well, it is the most wonderful world, and as a mercenary-mage I've seen a lot of worlds. Of course, some might say that it is a typical futile world of sand and stones, where summer sand melts from the heat and turns into glass - but it's my native land.<br>We've left you far behind in our development. Litan is a world of techno magic, one of the ancient worlds. We create complex precision devices and multi-dimensional conjurations. We learned to travel to other worlds long ago, and obtained various precious secrets from all over, improving our science and magic.<br>Oh, what's the use talking about it. But yes, I'd like to show you my world. One day's walk around my palace by the Calestan Sand falls - that alone would be enough to amaze you to the end of your days.
chat_system_152622787_snap_0_answer_7=^?^(Close the Chest...)
chat_system_152622787_snap_4_question=^?^You said that your mountain dwarves make complex devices.... Excellent! There, that place. The energy is surely there.<br>[dwarfmap]
chat_system_152622787_snap_4_answer_0=^?^Ok, we'll look for this place in the land of the dwarves.
chat_system_152622787_snap_10_question=^?^Oh, yes, let me introduce myself - first class battle sorceress Lina Itanieles. A mercenary - indeed, one of the best mercenaries - plus a mage-constructor, though a class lower in that profession. Nevertheless, my battle devices are in high demand on my native Litan! Also I'm a close relative of the Emperor.
chat_system_152622787_snap_10_answer_0=^?^The Emperor's relative? So you're of noble blood?
chat_system_152622787_snap_10_header_0=^?^One of the highest, believe me. My great-aunt was the daughter of the second cousin of a cousin of the fourteenth wife of the cousin of the mother of the Emperor, may she be glorified in all the ages throughout the universes.
chat_system_152622787_snap_10_answer_1=^?^In your world does everyone look like you?
chat_system_152622787_snap_10_answer_2=^?^What does the word "mage-constructor" mean?
chat_system_152622787_snap_10_header_2=^?^I'm an expert techno-mage, my silly medieval knight. I can invent, assemble, repair and improve complex techno-magical devices. Generally speaking, I make different mechanical things, which work with the aid of magic.<br>By the way, my workshops were always heaping with orders; clients came to me even from different worlds.
chat_system_152622787_snap_10_answer_3=^?^I wanted to ask you another thing.
chat_system_152622787_snap_10_header_3=^?^Go on then; ask your question.... At least chatting with you is better than chatting with that stony blockhead, or that fanatic who can only talk about his precious Temple.
chat_system_152622787_snap_10_answer_4=^?^I have no more questions to you.
chat_system_152622787_snap_15_question=^?^I know I'm quite charming, thank you for the compliment. Nevertheless, I might turn you off a bit - what with your standards, the inhabitants of my world might seem rather unpleasant to you.
chat_system_152622787_snap_15_answer_0=^?^You're certainly charming, but I didn't mean your attractiveness.
chat_system_152622787_snap_16_question=^?^I know what you're talking about. The matter is that I'm not in my own flesh now. This is a holographic projection, a phantom, an unbodied spirit. During one terrible fight I overestimated my power and my body was quite simply destroyed. Fortunately, my will and my devices helped my mind to survive apart from my flesh.<br>I managed to place my mind's matrix into a mobile cryostat - that's a device that supports my mind's activity, and allows me to create this visual projection.
chat_system_152622787_snap_16_answer_0=^?^Can you explain it more simply? Don't forget I'm a silly... middle knight or what-do-you-call-it...
chat_system_152622787_snap_16_header_0=^?^That's why you look so funny. Sorry, I know it must be difficult for you to understand that there are plenty of other worlds besides yours where amazing creatures live. Though I understand that the Demons visited you once, so you must have some understanding of this.<br>Anyway, the throne I'm sitting on is a complicated mago-technical device in which my spirit is protectively enclosed. The device allows me to live, move around, and it creates this image that you're talking to. Your mages can definitely leave their bodies too, so you see I did something similar to that. But my body...you know...
chat_system_152622787_snap_21_question=^?^Let me see what devices in my arsenal are still working.<br>Well... The mana-booster works, but it's created for a single warrior, so you'll have to use it in an unusual way - just by scattering the sources of energy on the battlefield. The idea being that your warriors should manage to activate them first. I'm sorry it's a bit clumsy, but this weapon is designed for individual use.<br>The Combat Ball is almost ready for use; you'll definitely like this thing. Basically you can think of it as an additional combat unit, and quite a strong one.
chat_system_152622787_snap_21_answer_0=^?^The more I talk to you, the more alien and strange words I learn.
chat_system_152622787_snap_21_header_0=^?^That's just the beginning! Well, let's see.... The "Ice Trap" spell would also be useful, I guess.<br>And my pride - my own invention - Gizmo! Multifunctional Satellite-bodyguard. Intellectual "friend or foe" recognition system, emergency reanimation function, adrenaline booster function and built-in gamma-destructor.<br>Actually at the moment it's malfunctioning, but I'll repair it soon enough. Oh, uh, maybe for medieval knights I should explain it like this: this thing heals your friends and burns enemies.
chat_system_152622787_snap_5_question=^?^You know, I would agree to work with you anyhow. I'm just dying of boredom.<br>But, unfortunately, I am of no use right now. All the energy in my devices has been used up during these long years of incarceration. I have hardly enough for basic life support. The last of my reserves was spent when I froze our swamp prince, so he could live a little longer.
chat_system_152622787_snap_5_answer_0=^?^So, do you have any ideas?
chat_system_152622787_snap_6_question=^?^I see only one way - I need some source of energy to recharge my battle machines. Unfortunately, magic energy is of no use for that. I need to find something like a generator. Have you ever heard about electricity?
chat_system_152622787_snap_6_answer_0=^?^Generator... I guess, it's used for generating something? The second word is totally unfamiliar to me. Is it a famous mage from your world or is it a spell?
chat_system_152622787_snap_17_question=^?^Yeah, I can see that you're going to be difficult. At least you must have seen lightning, right? Ah and of course you've used similar magic yourself. In some of the other worlds that's called "electricity."<br>Ok, I get it, there's no use talking to you. Actually I think we're on to something. I managed to tune up the satellite and it shows that there's a stable natural electric power generator on your world. It's in a place with many mountains and underground passes, now let me just take some pictures from the orbit, wait a moment...
chat_system_152622787_snap_17_answer_0=^?^(wait...)
chat_system_152622787_snap_18_question=^?^[s]The sorceress sent some silvery thing up into the sky, and it sped away swiftly. Having returned some time later it disappeared into Lina's "throne".[/s]<br><br>Alright, so the photos are ready... Well-well... Wow! You've got a funny world, ha-ha, just look at this, I've never seen anything like that before! I wonder if you know about it.<br>...Ok, we'll talk about that some other time. Now, let me enlarge the image... Ok, look at this.
chat_system_152622787_snap_18_answer_0=^?^(Look at the image Lina gave you...)
chat_system_152622787_snap_19_question=^?^[s]The picture looks as if it's been drawn by an artist who decided to depict the land from the eye's of a flying bird. [/s]<br><br>[dwarfmap]<br><br><br>So - do you recognize this place?
chat_system_152622787_snap_19_answer_0=^?^Mountains, snow, constructions... This is somewhere in the dwarven lands.
chat_system_152622787_snap_20_question=^?^The same guys that made those cannons? They must be the technically developed race. So, you should find an energy source there.
chat_system_152622787_snap_20_answer_0=^?^If you need something connected with technics, you go to the dwarves. Alright, so let's search for your... electricity!
chat_system_152622787_switch_zariadka_header_1=^?^Great! Look, look - my charge indicators are blinking. That means that everything's ok, and the devices are charging. Come on, press it again!<br><br>The devices are recharged at: [eat]/[eatmax]
chat_system_152622787_switch_zariadka_header_2=^?^Well, ok, the process has started, the energy is accumulating. A few more charges and we can get out of here...<br>What are you waiting for? Give me some more!<br><br>The devices are recharged at: [eat]/[eatmax]
chat_system_152622787_switch_zariadka_header_3=^?^Oh, I feel good... Do you hear that Mana-booster droning? Combat Orb is already coming online, we should only recharge the satellite, since it lost most of its energy...<br><br>The devices are recharged at: [eat]/[eatmax]
chat_system_152622787_switch_zariadka_header_4=^?^[s]This time Lina's devices have let her down! The lightning broke away and nearly killed you. Fortunately, it turned out alright.[/s]<br>Oops... that's odd! I tried to activate the Orb and... Whew! It's the first time I've ever see that before. Well, come to think of it, it's also the first time I've recharged my devices from the lightning coming out of this huge can... I hope you're ok!<br><br>The devices are recharged at: [eat]/[eatmax]
chat_system_152622787_snap_7_question=^?^Oh! Gods of the abyss! What... what is that, a generator? Ha-ha, oh, don't make me laugh... I thought Endorian technologies would have no chance of surprising me!<br>Ok, jokes aside. The energy it has accumulated should be quite enough for me; so don't just stand there - pull the lever!
chat_system_152622787_snap_7_answer_0=^?^Wait-wait! But I'm standing in the circle.
chat_system_152622787_snap_8_question=^?^Don't worry, the lightning won't even touch you; it will be drawn into to my accumulators. I've already got them activated for recharging. Come on, don't just stare at it!<br><br>The devices are recharged at: [eat]/[eatmax]
chat_system_152622787_snap_8_answer_0=^?^(Pull the lever...)
chat_system_152622787_snap_3_question=^?^Relax, it's over. Now that my devices are recharged fully, you don't have to stand under those thunderbolts anymore.
chat_system_152622787_snap_3_answer_0=^?^Finally!
chat_system_152622787_snap_9_question=^?^Was it scary? Well, now you'll learn what a real battle techno-mage from Litan is like!<br>As defined in our agreement, I will now conclude our transaction. Endorian world resident, I am now at your disposal!
chat_system_152622787_snap_9_answer_0=^?^That's fine with me!
